package org.gx.simplewiki.exception;
/*************************************/
/*
 * 0 参数错误
 *   0 用户数据
 *       00 用户名
 * 0 0   00| 00 (保留)           [0x00000000]
 * 0 0   00| 01 用户名重复        [0x04000000]
 * 0 0   00| 10 有非法字符        [0x08000000]
 * 0 0   00| 11 过长或为空        [0x0C000000]
 *       01 昵称
 * 0 0   01| 00 （保留）          [0x10000000]
 * 0 0   01| 01 （保留）          [0x14000000]
 * 0 0   01| 10 （保留）          [0x18000000]
 * 0 0   01| 11 过长             [0x1C000000]
 *       10 信息
 * 0 0   10| 00000 用户信息丢失(info_id 未找到) [0x20000000]
 *       11 密码
 * 0 0   11| 00 (保留)           [0x30000000]
 * 0 0   11| 01 许可证登录失败     [0x34000000]
 * 0 0   11| 10 未找到许可证       [0x38000000]
 * 0 0   11| 11 过长或为空        [0x3C000000]
 *
 *   1 词条数据
 *       00 词条
 * 0 1   00  000 词条标题不存在    [0x40000000]
 * 0 1   00  001 词条标题重复      [0x42000000]
 * 0 1   00  010 标题长度为空或过长 [0x44000000]
 * 0 1   00  011 无创造者          [0x46000000]
 *       01 短文
 * 0 1   01  001 短文ID不存在      [0x52000000]
 * 0 1   01  010 标题长度为空或过长 [0x54000000]
 * 0 1   01  011 无创造者          [0x56000000]
 * 0 1   01  100 下标越界          [0x58000000]
 * 0 1   01  101 缺少词条ID        [0x5A000000]
 *       10 内容
 *       11 标签
 * 0 1   11  000 标签不存在        [0x70000000]
 *
 * 1 操作错误
 *   0 用户操作
 *       01 登录
 * 1 0   01 0 验证码错误         [0x90000000]
 * 1 0   01 1 登录信息错误       [0x98000000]
 *       10 注销
 * 1 0   10 1 注销失败           [0xA8000000]
 *   1 数据操作
 * 1 1   00
 * 1 1   00  00 数据库内部错误     [0xC0000000]
 * 1 1   00  01 用户未登录        [0xC4000000]
 * 1 1   00  10 无权操作          [0xC8000000]
 * 1 1   00  11 为查询到该用户     [0xCC000000]
 *       01  词条
 * 1 1   01  001 词条未找到       [0xD2000000]
 *       10  短文
 *
 *
 * */
public interface Expt {
    /**********用户名异常**********************/
    // 用户名重复
    int USER_NAME_REPEAT = 0x04000000;
    // 用户名存在非法字符
    int USER_NAME_INVALID_CHAR = 0x08000000;
    // 用户名长度错误
    int USER_NAME_LENGTH_ERR = 0x0C000000;
    /**********昵称异常***********************/
    // 昵称过长
    int USER_NICKNAME_TOO_LONG = 0x1C000000;
    /**********密码异常***********************/
    // 密码长度错误
    int PASSWORD_LENGTH_ERR = 0x3C000000;
    // 使用许可证登录失败
    int ACCESS_FAILURE = 0x34000000;
    // 许可证未找到
    int ACCESS_NONE_FOUND = 0x38000000;
    /**********词条异常***********************/
    int ENTRY_NONE_FOUND = 0x40000000;
    // 词条标题重复
    int ENTRY_TITLE_REPEAT = 0x42000000;
    // 标题长度错误
    int ENTRY_TITLE_LENGTH_ERR = 0x44000000;
    // 词条无创作者
    int ENTRY_NONE_CREATER = 0x46000000;
    /***********短文异常**********************/
    // 短文ID不存在
    int PAGE_ID_NONE_FOUND = 0x52000000;
    // 短文标题长度错误
    int PAGE_TITLE_LENGTH_ERR = 0x54000000;
    // 短文无创作者
    int PAGE_NONE_CREATER = 0x56000000;
    // 短文下标越界
    int PAGE_INDEX_OVERFLOW = 0x58000000;
    // 缺少词条依赖
    int PAGE_NONE_ENTRY = 0x5A000000;
    /************标签异常*********************/
    int LABEL_NONE_FOUND = 0x70000000;
    /*************************************/
    // 数据库错误
    int DATABASE_ERROR = 0xC0000000;
    // 用户未登录
    int OPT_NONE_CURRENT_USER = 0xC4000000;
    // 无权操作
    int OPT_NONE_PERMISSION = 0xC8000000;
    // 未查找到该用户
    int OPT_USER_NONE_FOUND = 0xCC000000;
    /***********词条操作**********************/
    // 词条未找到
    int OPT_ENTRY_NONE_FOUND = 0xD2000000;
    // 验证码错误
    int VALIDCODE_ERROR = 0x90000000;
    // 登录信息错误
    int SIGNIN_INFO_ERROR = 0x98000000;
    // 注销失败
    int SIGNOUT_FAILURE = 0xA8000000;
}
